---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentImage
source: html/37fb3691-b21d-61ff-7576-efc08a2fd57a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentImage Property

While making curved beam type "[Type Name]" Image elements were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentImage { get; }
```